app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`) VALUES ('É bom esse Rails!', 'Grande Edécio.', '2022-02-15 12:08:42.440915', '2022-02-15 12:08:42.440915', 'public')

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'É bom esse Rails!', `articles`.`body` = 'Grande professor Edécio.', `articles`.`updated_at` = '2022-02-14 14:18:47.332413' WHERE `articles`.`id` = 1