app/controllers/comments_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`, `status`) VALUES ('Igor', 'verdade', 2, '2022-02-15 12:58:25.599032', '2022-02-15 12:58:25.599032', 'public')
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 AND `comments`.`id` = 1 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
    binding.pry
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy